stevennolte/Module_Firmware/ESP32_Product_Controller/src/main.cpp
// File upload handler
void handleFileUpload(AsyncWebServerRequest *request, String filename, size_t index, uint8_t *data, size_t len, bool final) {
  if (!index) {
    // Open file for writing
    Serial.printf("UploadStart: %s\n", filename.c_str());
    request->_tempFile = LittleFS.open("/" + filename, "w");
  }
  if (len) {
    // Write the file content
    request->_tempFile.write(data, len);
  }
  if (final) {
    // Close the file
    request->_tempFile.close();
    Serial.printf("UploadEnd: %s, %u B\n", filename.c_str(), index + len);
    request->send(200, "text/plain", "File Uploaded");
  }
}

void handleMomentaryCommand(AsyncWebServerRequest *request) {
  if (request->hasParam("button") && request->hasParam("action")) {
    String button = request->getParam("button")->value();
    String action = request->getParam("action")->value();

    Serial.printf("Momentary Command: Button=%s, Action=%s\n", button.c_str(), action.c_str());

    // Add your logic here to handle the momentary button actions
    // LEFT FLIP 
    if (button == "leftFlipOut") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.leftFlip] = 1;
        
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.leftFlip] = 0;
      } else {
        Serial.println("Unknown action received for LeftFlipOut.");
      }
    } else if (button == "leftFlipIn") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.leftFlip] = 2;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.leftFlip] = 0;
      } else {
        Serial.println("Unknown action received for LeftFlipIn.");
      }
    } else if (button == "leftLiftUp") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.leftLift] = 1;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.leftLift] = 0;
      } else {
        Serial.println("Unknown action received for LeftLiftOut.");
      }
    } else if (button == "leftLiftDown") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.leftLift] = 2;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.leftLift] = 0;
      } else {
        Serial.println("Unknown action received for LeftLiftIn.");
      }
    } else if (button == "leftFoldOut") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.leftFold] = 1;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.leftFold] = 0;
      } else {
        Serial.println("Unknown action received for LeftFoldOut.");
      }
    } else if (button == "leftFoldIn") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.leftFold] = 2;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.leftFold] = 0;
      } else {
        Serial.println("Unknown action received for LeftFoldIn.");
      }
    } else if (button == "centerUp") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.center] = 1;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.center] = 0;
      } else {
        Serial.println("Unknown action received for CenterOut.");
      }
    } else if (button == "centerDown") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.center] = 2;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.center] = 0;
      } else {
        Serial.println("Unknown action received for CenterIn.");
      }
    } else if (button == "rightFoldOut") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.rightFold] = 1;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.rightFold] = 0;
      } else {
        Serial.println("Unknown action received for RightFoldOut.");
      }
    } else if (button == "rightFoldIn") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.rightFold] = 2;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.rightFold] = 0;
      } else {
        Serial.println("Unknown action received for RightFoldIn.");
      }
    } else if (button == "rightLiftUp") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.rightLift] = 1;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.rightLift] = 0;
      } else {
        Serial.println("Unknown action received for RightLiftOut.");
      }
    } else if (button == "rightLiftDown") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.rightLift] = 2;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.rightLift] = 0;
      } else {
        Serial.println("Unknown action received for RightLiftIn.");
      }
    } else if (button == "rightFlipOut") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.rightFlip] = 1;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.rightFlip] = 0;
      } else {
        Serial.println("Unknown action received for RightFlipOut.");
      }
    } else if (button == "rightFlipIn") {
      if (action == "start") {
        espConfig.foldData.foldStates[espConfig.foldData.rightFlip] = 2;
      } else if (action == "stop") {
        espConfig.foldData.foldStates[espConfig.foldData.rightFlip] = 0;
      } else {
        Serial.println("Unknown action received for RightFlipIn.");
      }
    } else {


      Serial.println("Unknown button received.");
    }

    request->send(200, "text/plain", "Momentary command processed");
  } else {
    request->send(400, "text/plain", "Invalid parameters");
  }
}

